const HelperAcrossRiver = (helper, name) => {
  let text = "";
  switch (helper) {
    case "меч і щит":
      text += `розрубав мечем мотузку, що нею був прив'язаний човен `;
      break;
    case "чарівна палочка":
      text += `змахнув чарівною палочкою і ланцюг, що ним був прив'язаний човен, перетворився на порох. ${name} сів у човен `;
      break;
    case "лук і стріли":
      text += `вистрілив зі свого лука, та й так розірвав мотузку, що нею був прив'язаний човен `;
      break;
    case "кінь":
      text += `а потім кінь його (а кінь той був чарівний) торкнувся підковою ланцюга, що ним був прив'язаний човен і ланцюг перетворився на порох. ${name} сів у човен `;
      break;
    case "троянда":
      text += `зірвав пелюстку з чарівної троянди, опустив її на ланцюг, що ним був прив'язаний човен і той перетворився на порох. ${name} сів у човен `;
      break;
    default:
  }

  return text;
};

export default HelperAcrossRiver;
