import { waterPlace } from "../arrays/arrays";
import findRandomElement from "./findRandomElement";

const MermaidPart2 = (place, mood) => {
  let text = "";
  let riverOrLake = "";
  let riverOrLakeShort = "";

  if (place === "чарівний ліс") {
    text += `в озері захованому в хащах густого-густого лісу, хоча не раз їх бачили на болотах. `;
  } else if (place === "море/океан...") {
    text += `на дні глибокого моря. Там вони будували високі коралові палаци `;
    if (mood === "моторошна") {
      text += `в яких ніхто ніколи не жив. Вежі здіймалися з глибин, немов покинуті скульптури, і стояли собі серед води порожні і самотні.`;
    }
  } else if (place === "гори") {
    riverOrLake = findRandomElement(waterPlace);
    if (waterPlace === "глибокого озера") {
      riverOrLakeShort = "озерн";
    } else {
      riverOrLakeShort = "річков";
    }
    text += `на дні ${riverOrLake} і їм було дуже-дуже холодно. Коли наставала зима, їхня луска тверділа, мов лід і русалки опускалися на ${riverOrLakeShort}е дно, невзмозі поворухнути хвостами. Там вони лежали всю зиму, мов кришталеві скульптури`;

    if (mood === "моторошна") {
      text += ` i ніхто, крім потопельників, не міг побачити їх`;
    }

    text += `. А наприкінці весни, коли лід танув, русалки підіймалися на поверхню, бентежили незворушні води і співали. З їхніх вуст зривався холодний подих і над ${riverOrLakeShort}им плесом стелився туман. `;
  } else if (place === "місто") {
    text += `колись в морі, в своїх коралових палацах, де золота луска їхня виблискувала в фосфорному світлі. Та врешті їх спіймали в тенета жорстокі люди, бо ж русалки були чарівні і вміли виконувати бажання. Тепер вони жили у великих містах, заточені в  акваріуми і щоб не померти з голоду виконували забаганки багатих людей.`;
  }

  return text;
};

export default MermaidPart2;
