const MeramidPart3 = (place, mood, name) => {
  let text = "";

  switch (place) {
    case "чарівний ліс":
      text += `Піднялась одної ночі ${name} на поверхню озера, `;
      if (mood === "моторошна") {
        text += `подивитися на повний місяць, `;
      }
      text += `а там на вершечку дерева, що росло на березі, сидів неймовірної краси птах із золотим пір'ям. `;
      break;
    case "море/океан...":
      text += `Одного разу`;
      if (mood !== "моторошна") {
        text += `, коли ${name} визирала з вікна свого палацу, то `;
      } else {
        text += ` ${name} `;
      }
      text += `побачила велику тінь над собою, виринула на поверхню і виявилось, що це великий корабель похитувався на хвилях. `;
      break;
    case "гори":
      text += `Одного разу, коли вже наближалася зима, ${name} обгорнула себе водоростями, і з жахом дивилася, як її подруги та сестри `;
      if (mood === "моторошна") {
        text += `, немов покійниці, `;
      }
      text += `опускаються на дно. Потім ${name} виринула на поверхню і побачила навколо лише гори в снігу. Вона зібралася з духом і вистрибнула на холодний кам'яний берег. `;
      break;
    case "місто":
      text += `Одного разу прийшов до неї королівський слуга і захотів загадати бажання. `;
      break;
    default:
  }

  return text;
};

export default MeramidPart3;
