export const protagonistsAll = [
  "лицар",
  "дракон",
  "чарівник",
  // "ельф",
  "принцеса",
  "чарівниця",
  "русалка",
];

export const placesAll = ["чарівний ліс", "море/океан...", "гори", "місто"];

export const helpers = [
  "меч і щит",
  "чарівна палочка",
  "лук і стріли",
  "кінь",
  "троянда",
];

export const powers = [
  "вміння літати",
  "невидимість",
  "швидкість",
  "суперсила",
  "почуття гумору",
];

export const moodOf = [
  "повчальна",
  "героїчна",
  "моторошна",
  // "весела"
];

export const waterPlace = ["глибокого озера", "глибокої річки"];

export const namesKnightWizard = ["Полель", "Яр", "Артур"];

export const namesPrincessWitch = ["Еліза", "Анна", "Леля"];

export const namesDragon = [
  "Ельдур", // "Вогонь" ісландською
  "Катла", // "Котел" ісландською
  "Дрехкі", // "Дракон" ісландською
];

// export const namesElf = [
//   "Aульвур", // "Ельф" ісландською
//   "Ілівер", // "" ельфійською
// ];

export const namesMermaid = [
  "Мор-Ворвін", // валійською
  "Мара", // частково ірландською/ґельською
  "Сирена",
];

export const mountainPlaceDragon = [
  "на кам'яних схилах, випалених їхнім гарячим подихом",
  "на голих скелях, що звисали над прірвою",
];

export const placesForest = [
  `високо на деревах, в домівках, сплетених з гілок і листя`,
  `де земля встелена оксамитовим мохом і всіяна маленькими квітами, мов зірочками`,
  `що приховані від усіх білим туманом`,
  `що ховаються за білими хмарами`,
  `що приховані чарами від цікавих очей`,
];

export const beginning = [
  "Давним-давно,",
  "Було це дуже і дуже давно,",
  "Легенди розповідають, що колись,",
  "Розповідала моя бабуся, а їй її бабуся, що колись,",
  "В одній далекій країні, якої давно вже нема,",
  "За семи горами, за семи морями",
  "В одному далекому-далекому світі",
];

export const beginningPlus = [
  "коли люди ще вірили в різні чудеса,",
  "коли різноманітні боги жили з людьми на цій землі,",
  "коли сонце сходило на заході, а сідало на сході,",
  "коли Земля оберталася в інший бік,",
  "коли Земля крутилася так швидко, що рік минав удвічі швидше, ніж тепер,",
];

export const expoHero = [`жив-був`, `жив такий собі`, `жив один`];
export const expoHeroess = [`жила-була`, `жила`, `жила одна`];

export const continue1 = [
  "у густих-густих лісах",
  "в печерах високих гір",
  "високо в горах",
  "на дні моря",
  "високо в горах на дні глибокого озера",
  "в озері серед густого-густого лісу",
  "на кам'яному дні глибокої річки",
  "у великому місті",
];

export const placesPlusMountain = [
  `на широких полонинах, де росли дикі маки і видно було, як сонце сідає за обрій`,
  "вигнані жорстокими людьми зі своїх рідних лісів, приречені існувати серед скель і палючого сонця",
  `оточені кільцем високих скель. У місті, до якого не вела жодна стежка, і дістатися якого не можна було жодним шляхом крім того, як прилетіти на спині великого птаха`,
];
