export const beginning = [
  "Давним-давно",
  "Було це дуже і дуже давно",
  "Легенди розповідають, що колись",
  "Розповідала моя бабуся, а їй її бабуся, що колись",
  "В одній далекій країні, якої давно вже нема",
  "За семи горами, за семи морями",
  "В одному далекому-далекому світі",
];

export const beginningPlus = [
  "коли люди ще вірили в різні чудеса",
  "коли різноманітні боги жили з людьми на цій землі",
  "коли сонце сходило на заході, а сідало на сході",
  "коли Земля оберталася в інший бік",
  "коли Земля крутилася так швидко, що рік минав удвічі швидше, ніж тепер",
];
